

public class JavaRush2_12

/* Дублирование строки
Написать функцию, которая выводит переданную строку на экран три раза, каждый раз с новой строки.
*/

{
    public static void print3(String s)
    {
        //напишите тут ваш код
    	  
    		System.out.println(s);
    		System.out.println(s);
    		System.out.println(s);
    	    

    }

    public static void main(String[] args)
    {
        print3("I love you!");
    }
}