

public class JavaRush3_1



/* Реализация метода
Реализуйте метод public static void div(int a, int b).
Метод должен делить первое число на второе, и выводить на экран результат деления а / b.
*/

{
    public static void main(String[] args) {
        div(6,3);
        div(10,6);
        div(2,4);
    }

    public static void div(int a, int b){
        //напишите тут ваш код
    	int c;
    	c = a / b;
    	System.out.println(c);
    }
}