

public class JavaRush2_7

/* Сумма и произведение
В методе main обьявите две целочисельные переменные a и b типа int. Присвойте им любые значения.
Выведите на экран их сумму и произведение. Каждое значение выводить с новой строки.
Пример вывода на экран для а = 5, b = 7:
12
35
*/


{
    public static void main(String[] args) {
        //напишите тут ваш код
    	int a = 5;
    	int b = 7;
    	//System.out.print("a = ");
    	//System.out.print( a );
    	//System.out.print(", ");
    	//System.out.print("b = ");
    	//System.out.println( b );
    	System.out.println(a + b);
    	System.out.print(a * b);
    }
}

