package JavaRush;

public class JavaRush2_9

/* Три собаки - это сила
Создать 3 объекта типа Dog (собака) и присвоить им имена "Max", "Bella", "Jack".
*/

{
    public static void main(String[] args)
    {
       
        System.out.println("Будешь плохо кодить, придет Java и съест твою память");
        //System.out.println(dog2.name);
        //System.out.println(dog3.name);

        //напишите тут ваш код
    }

    
}